verification/runs/F14-cooling-ladder/K2b_runs/K2bU3_M/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.536281e+00;

boundaryField
{
    floor
    {
        type            omegaWallFunction;
        value           uniform 2.536281e+00;
    }
    ceiling
    {
        type            omegaWallFunction;
        value           uniform 2.536281e+00;
    }
    wall_cold
    {
        type            omegaWallFunction;
        value           uniform 2.536281e+00;
    }
    wall_hot
    {
        type            omegaWallFunction;
        value           uniform 2.536281e+00;
    }
    rack_top
    {
        type            omegaWallFunction;
        value           uniform 2.536281e+00;
    }
    tile
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.06;
        value           uniform 2.536281e+00;
    }
    rack_out
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.2;
        value           uniform 3.260932e-01;
    }
    rack_in
    {
        type            zeroGradient;
    }
    return
    {
        type            inletOutlet;
        inletValue      uniform 2.536281e+00;
        value           uniform 2.536281e+00;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
